STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231axx_cm33.h
/*
 * @brief USB3 Global Register Block
 */

typedef struct
{
  __IO uint32_t GSBUSCFG0;         /*!< (null) @ offset 0x0 */
  __IO uint32_t GSBUSCFG1;         /*!< (null) @ offset 0x4 */
  __IO uint32_t GTXTHRCFG;         /*!< (null) @ offset 0x8 */
  __IO uint32_t GRXTHRCFG;         /*!< (null) @ offset 0xc */
  __IO uint32_t GCTL;              /*!< (null) @ offset 0x10 */
  __IO uint32_t GPMSTS;            /*!< (null) @ offset 0x14 */
  __IO uint32_t GSTS;              /*!< (null) @ offset 0x18 */
  __IO uint32_t GUCTL1;            /*!< (null) @ offset 0x1c */
  __IO uint32_t GSNPSID;           /*!< (null) @ offset 0x20 */
  __IO uint32_t GGPIO;             /*!< (null) @ offset 0x24 */
  __IO uint32_t GUID;              /*!< (null) @ offset 0x28 */
  __IO uint32_t GUCTL;             /*!< (null) @ offset 0x2c */
  __IO uint32_t GBUSERRADDRLO;     /*!< (null) @ offset 0x30 */
  __IO uint32_t GBUSERRADDRHI;     /*!< (null) @ offset 0x34 */
  __IO uint32_t GPRTBIMAPLO;       /*!< (null) @ offset 0x38 */
  __IO uint32_t GPRTBIMAPHI;       /*!< (null) @ offset 0x3c */
  __IO uint32_t GHWPARAMS0;        /*!< (null) @ offset 0x40 */
  __IO uint32_t GHWPARAMS1;        /*!< (null) @ offset 0x44 */
  __IO uint32_t GHWPARAMS2;        /*!< (null) @ offset 0x48 */
  __IO uint32_t GHWPARAMS3;        /*!< (null) @ offset 0x4c */
  __IO uint32_t GHWPARAMS4;        /*!< (null) @ offset 0x50 */
  __IO uint32_t GHWPARAMS5;        /*!< (null) @ offset 0x54 */
  __IO uint32_t GHWPARAMS6;        /*!< (null) @ offset 0x58 */
  __IO uint32_t GHWPARAMS7;        /*!< (null) @ offset 0x5c */
  __IO uint32_t GDBGFIFOSPACE;     /*!< (null) @ offset 0x60 */
  __IO uint32_t GDBGLTSSM;         /*!< (null) @ offset 0x64 */
  __IO uint32_t GDBGLNMCC;         /*!< (null) @ offset 0x68 */
  __IO uint32_t GDBGBMU;           /*!< (null) @ offset 0x6c */
  __IO uint32_t GDBGLSPMUX_HST;    /*!< (null) @ offset 0x70 */
  __IO uint32_t GDBGLSP;           /*!< (null) @ offset 0x74 */
  __IO uint32_t GDBGEPINFO0;       /*!< (null) @ offset 0x78 */
  __IO uint32_t GDBGEPINFO1;       /*!< (null) @ offset 0x7c */
  __IO uint32_t GPRTBIMAP_HSLO;    /*!< (null) @ offset 0x80 */
  __IO uint32_t GPRTBIMAP_HSHI;    /*!< (null) @ offset 0x84 */
  __IO uint32_t GPRTBIMAP_FSLO;    /*!< (null) @ offset 0x88 */
  __IO uint32_t GPRTBIMAP_FSHI;    /*!< (null) @ offset 0x8c */
       uint32_t RESERVED0[3];      /*!< Reserved @ offset 0x90-0x98 */
  __IO uint32_t GUCTL2;            /*!< (null) @ offset 0x9c */
       uint32_t RESERVED1[24];     /*!< Reserved @ offset 0xa0 */
  __IO uint32_t GUSB2PHYCFG;       /*!< (null) @ offset 0x100 */
       uint32_t RESERVED2[31];     /*!< Reserved @ offset 0x104-0x17C */
  __IO uint32_t GUSB2PHYACC_UTMI;  /*!< (null) @ offset 0x180 */
       uint32_t RESERVED3[15];     /*!< Reserved @ offset 0x184 */
  __IO uint32_t GUSB3PIPECTL;      /*!< (null) @ offset 0x1c0 */
       uint32_t RESERVED4[15];     /*!< Reserved @ offset 0x1c4 */
  __IO uint32_t GTXFIFOSIZ0;       /*!< (null) @ offset 0x200 */
  __IO uint32_t GTXFIFOSIZ1;       /*!< (null) @ offset 0x204 */
  __IO uint32_t GTXFIFOSIZ2;       /*!< (null) @ offset 0x208 */
  __IO uint32_t GTXFIFOSIZ3;       /*!< (null) @ offset 0x20c */
  __IO uint32_t GTXFIFOSIZ4;       /*!< (null) @ offset 0x210 */
  __IO uint32_t GTXFIFOSIZ5;       /*!< (null) @ offset 0x214 */
  __IO uint32_t GTXFIFOSIZ6;       /*!< (null) @ offset 0x218 */
  __IO uint32_t GTXFIFOSIZ7;       /*!< (null) @ offset 0x21c */
  __IO uint32_t GTXFIFOSIZ8;       /*!< (null) @ offset 0x220 */
  __IO uint32_t GTXFIFOSIZ9;       /*!< (null) @ offset 0x224 */
  __IO uint32_t GTXFIFOSIZ10;      /*!< (null) @ offset 0x228 */
  __IO uint32_t GTXFIFOSIZ11;      /*!< (null) @ offset 0x22c */
       uint32_t RESERVED5[20];     /*!< Reserved @ offset 0x230 */
  __IO uint32_t GRXFIFOSIZ0;       /*!< (null) @ offset 0x280 */
  __IO uint32_t GRXFIFOSIZ1;       /*!< (null) @ offset 0x284 */
  __IO uint32_t GRXFIFOSIZ2;       /*!< (null) @ offset 0x288 */
       uint32_t RESERVED6[29];     /*!< Reserved @ offset 0x28c */
  __IO uint32_t GEVNTADRLO;        /*!< (null) @ offset 0x300 */
  __IO uint32_t GEVNTADRHI;        /*!< (null) @ offset 0x304 */
  __IO uint32_t GEVNTSIZ;          /*!< (null) @ offset 0x308 */
  __IO uint32_t GEVNTCOUNT;        /*!< (null) @ offset 0x30c */
       uint32_t RESERVED7[124];    /*!< Reserved @ offset 0x310 */
  __IO uint32_t GHWPARAMS8;        /*!< (null) @ offset 0x500 */
       uint32_t RESERVED8[2];      /*!< Reserved @ offset 0x504 */
  __IO uint32_t GUCTL3;            /*!< (null) @ offset 0x50C */
  __IO uint32_t GTXFIFOPRIDEV;     /*!< (null) @ offset 0x510 */
       uint32_t RESERVED9;         /*!< Reserved @ offset 0x514 */
  __IO uint32_t GTXFIFOPRIHST;     /*!< (null) @ offset 0x518 */
  __IO uint32_t GRXFIFOPRIHST;     /*!< (null) @ offset 0x51c */
       uint32_t RESERVED10;        /*!< Reserved @ offset 0x520 */
  __IO uint32_t GDMAHLRATIO;       /*!< (null) @ offset 0x524 */
       uint32_t RESERVED11[2];     /*!< Reserved @ offset 0x528 */
  __IO uint32_t GFLADJ;            /*!< (null) @ offset 0x530 */
       uint32_t RESERVED12[3];       /*!< Reserved @ offset 0x534-0x53C */
  __IO uint32_t USB3_GUSB2RHBCTL;  /*!< (null) @ offset 0x540 */
       uint32_t RESERVED13[47];      /*!< Reserved @ offset 0x544-0x5FC */
} USB3_GBL_TypeDef;

/*
 * @brief USB3 Device Register Block
 */

typedef struct
{
  __IO uint32_t DCFG;             /*!< (null) @ offset 0x0 */
  __IO uint32_t DCTL;             /*!< (null) @ offset 0x4 */
  __IO uint32_t DEVTEN;           /*!< (null) @ offset 0x8 */
  __IO uint32_t DSTS;             /*!< (null) @ offset 0xc */
  __IO uint32_t DGCMDPAR;         /*!< (null) @ offset 0x10 */
  __IO uint32_t DGCMD;            /*!< (null) @ offset 0x14 */
       uint32_t RESERVED14[2];    /*!< Reserved @ offset 0x18 */
  __IO uint32_t DALEPENA;         /*!< (null) @ offset 0x20 */
       uint32_t RESERVED15[55];   /*!< Reserved @ offset 0x24-0xFC */
  __IO uint32_t DEPCMDPAR20;      /*!< (null) @ offset 0x100 */
  __IO uint32_t DEPCMDPAR10;      /*!< (null) @ offset 0x104 */
  __IO uint32_t DEPCMDPAR00;      /*!< (null) @ offset 0x108 */
  __IO uint32_t DEPCMD0;          /*!< (null) @ offset 0x10c */
  __IO uint32_t DEPCMDPAR21;      /*!< (null) @ offset 0x110 */
  __IO uint32_t DEPCMDPAR11;      /*!< (null) @ offset 0x114 */
  __IO uint32_t DEPCMDPAR01;      /*!< (null) @ offset 0x118 */
  __IO uint32_t DEPCMD1;          /*!< (null) @ offset 0x11C */
  __IO uint32_t DEPCMDPAR22;      /*!< (null) @ offset 0x120 */
  __IO uint32_t DEPCMDPAR12;      /*!< (null) @ offset 0x124 */
  __IO uint32_t DEPCMDPAR02;      /*!< (null) @ offset 0x128 */
  __IO uint32_t DEPCMD2;          /*!< (null) @ offset 0x12C */
  __IO uint32_t DEPCMDPAR23;      /*!< (null) @ offset 0x130 */
  __IO uint32_t DEPCMDPAR13;      /*!< (null) @ offset 0x134 */
  __IO uint32_t DEPCMDPAR03;      /*!< (null) @ offset 0x138 */
  __IO uint32_t DEPCMD3;          /*!< (null) @ offset 0x13C */
  __IO uint32_t DEPCMDPAR24;      /*!< (null) @ offset 0x140 */
  __IO uint32_t DEPCMDPAR14;      /*!< (null) @ offset 0x144 */
  __IO uint32_t DEPCMDPAR04;      /*!< (null) @ offset 0x148 */
  __IO uint32_t DEPCMD4;          /*!< (null) @ offset 0x14C */
  __IO uint32_t DEPCMDPAR25;      /*!< (null) @ offset 0x150 */
  __IO uint32_t DEPCMDPAR15;      /*!< (null) @ offset 0x154 */
  __IO uint32_t DEPCMDPAR05;      /*!< (null) @ offset 0x158 */
  __IO uint32_t DEPCMD5;          /*!< (null) @ offset 0x15C */
  __IO uint32_t DEPCMDPAR26;      /*!< (null) @ offset 0x160 */
  __IO uint32_t DEPCMDPAR16;      /*!< (null) @ offset 0x164 */
  __IO uint32_t DEPCMDPAR06;      /*!< (null) @ offset 0x168 */
  __IO uint32_t DEPCMD6;          /*!< (null) @ offset 0x16C */
  __IO uint32_t DEPCMDPAR27;      /*!< (null) @ offset 0x170 */
  __IO uint32_t DEPCMDPAR17;      /*!< (null) @ offset 0x174 */
  __IO uint32_t DEPCMDPAR07;      /*!< (null) @ offset 0x178 */
  __IO uint32_t DEPCMD7;          /*!< (null) @ offset 0x17C */
  __IO uint32_t DEPCMDPAR28;      /*!< (null) @ offset 0x180 */
  __IO uint32_t DEPCMDPAR18;      /*!< (null) @ offset 0x184 */
  __IO uint32_t DEPCMDPAR08;      /*!< (null) @ offset 0x188 */
  __IO uint32_t DEPCMD8;          /*!< (null) @ offset 0x18C */
  __IO uint32_t DEPCMDPAR29;      /*!< (null) @ offset 0x190 */
  __IO uint32_t DEPCMDPAR19;      /*!< (null) @ offset 0x194 */
  __IO uint32_t DEPCMDPAR09;      /*!< (null) @ offset 0x198 */
  __IO uint32_t DEPCMD9;          /*!< (null) @ offset 0x19C */
  __IO uint32_t DEPCMDPAR210;     /*!< (null) @ offset 0x1A0 */
  __IO uint32_t DEPCMDPAR110;     /*!< (null) @ offset 0x1A4 */
  __IO uint32_t DEPCMDPAR010;     /*!< (null) @ offset 0x1A8 */
  __IO uint32_t DEPCMD10;         /*!< (null) @ offset 0x1AC */
  __IO uint32_t DEPCMDPAR211;     /*!< (null) @ offset 0x1B0 */
  __IO uint32_t DEPCMDPAR111;     /*!< (null) @ offset 0x1B4 */
  __IO uint32_t DEPCMDPAR011;     /*!< (null) @ offset 0x1B8 */
  __IO uint32_t DEPCMD11;         /*!< (null) @ offset 0x1BC */
  __IO uint32_t DEPCMDPAR212;     /*!< (null) @ offset 0x1C0 */
  __IO uint32_t DEPCMDPAR112;     /*!< (null) @ offset 0x1C4 */
  __IO uint32_t DEPCMDPAR012;     /*!< (null) @ offset 0x1C8 */
  __IO uint32_t DEPCMD12;         /*!< (null) @ offset 0x1CC */
  __IO uint32_t DEPCMDPAR213;     /*!< (null) @ offset 0x1D0 */
  __IO uint32_t DEPCMDPAR113;     /*!< (null) @ offset 0x1D4 */
  __IO uint32_t DEPCMDPAR013;     /*!< (null) @ offset 0x1D8 */
  __IO uint32_t DEPCMD13;         /*!< (null) @ offset 0x1DC */
  __IO uint32_t DEPCMDPAR214;     /*!< (null) @ offset 0x1E0 */
  __IO uint32_t DEPCMDPAR114;     /*!< (null) @ offset 0x1E4 */
  __IO uint32_t DEPCMDPAR014;     /*!< (null) @ offset 0x1E8 */
  __IO uint32_t DEPCMD14;         /*!< (null) @ offset 0x1EC */
  __IO uint32_t DEPCMDPAR215;     /*!< (null) @ offset 0x1F0 */
  __IO uint32_t DEPCMDPAR115;     /*!< (null) @ offset 0x1F4 */
  __IO uint32_t DEPCMDPAR015;     /*!< (null) @ offset 0x1F8 */
  __IO uint32_t DEPCMD15;         /*!< (null) @ offset 0x1FC */
  __IO uint32_t DEPCMDPAR216;     /*!< (null) @ offset 0x200 */
  __IO uint32_t DEPCMDPAR116;     /*!< (null) @ offset 0x204 */
  __IO uint32_t DEPCMDPAR016;     /*!< (null) @ offset 0x208 */
  __IO uint32_t DEPCMD16;         /*!< (null) @ offset 0x20C */
  __IO uint32_t DEPCMDPAR217;     /*!< (null) @ offset 0x210 */
  __IO uint32_t DEPCMDPAR117;     /*!< (null) @ offset 0x214 */
  __IO uint32_t DEPCMDPAR017;     /*!< (null) @ offset 0x218 */
  __IO uint32_t DEPCMD17;         /*!< (null) @ offset 0x21C */
  __IO uint32_t DEPCMDPAR218;     /*!< (null) @ offset 0x220 */
  __IO uint32_t DEPCMDPAR118;     /*!< (null) @ offset 0x224 */
  __IO uint32_t DEPCMDPAR018;     /*!< (null) @ offset 0x228 */
  __IO uint32_t DEPCMD18;         /*!< (null) @ offset 0x22C */
  __IO uint32_t DEPCMDPAR219;     /*!< (null) @ offset 0x230 */
  __IO uint32_t DEPCMDPAR119;     /*!< (null) @ offset 0x234 */
  __IO uint32_t DEPCMDPAR019;     /*!< (null) @ offset 0x238 */
  __IO uint32_t DEPCMD19;         /*!< (null) @ offset 0x23C */
  __IO uint32_t DEPCMDPAR220;     /*!< (null) @ offset 0x240 */
  __IO uint32_t DEPCMDPAR120;     /*!< (null) @ offset 0x244 */
  __IO uint32_t DEPCMDPAR020;     /*!< (null) @ offset 0x248 */
  __IO uint32_t DEPCMD20;         /*!< (null) @ offset 0x24C */
  __IO uint32_t DEPCMDPAR221;     /*!< (null) @ offset 0x250 */
  __IO uint32_t DEPCMDPAR121;     /*!< (null) @ offset 0x254 */
  __IO uint32_t DEPCMDPAR021;     /*!< (null) @ offset 0x258 */
  __IO uint32_t DEPCMD21;         /*!< (null) @ offset 0x25C */
  __IO uint32_t DEPCMDPAR222;     /*!< (null) @ offset 0x260 */
  __IO uint32_t DEPCMDPAR122;     /*!< (null) @ offset 0x264 */
  __IO uint32_t DEPCMDPAR022;     /*!< (null) @ offset 0x268 */
  __IO uint32_t DEPCMD22;         /*!< (null) @ offset 0x26C */
  __IO uint32_t DEPCMDPAR223;     /*!< (null) @ offset 0x270 */
  __IO uint32_t DEPCMDPAR123;     /*!< (null) @ offset 0x274 */
  __IO uint32_t DEPCMDPAR023;     /*!< (null) @ offset 0x278 */
  __IO uint32_t DEPCMD23;         /*!< (null) @ offset 0x27C */
       uint32_t RESERVED16[32];   /*!< (null) @ offset 0x280-0x2FC */
  __IO uint32_t DEV_IMOD;         /*!< (null) @ offset 0x300 */
       uint32_t RESERVED17[139];  /*!< Reserved @ offset 0x304-0x52C */
} USB3_DEV_TypeDef;

