STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231axx_cm33.h
#define HPDMA3_Channel14            HPDMA3_Channel14_NS
#define HPDMA3_Channel14_BASE       HPDMA3_Channel14_BASE_NS

#define HPDMA3_Channel15            HPDMA3_Channel15_NS
#define HPDMA3_Channel15_BASE       HPDMA3_Channel15_BASE_NS

/*!< AHB3 peripherals defaults to Non secure aliases */
#define HASH                        HASH_NS
#define HASH_BASE                   HASH_BASE_NS

#define HASH_DIGEST                 HASH_DIGEST_NS
#define HASH_DIGEST_BASE            HASH_DIGEST_BASE_NS

#define RNG                         RNG_NS
#define RNG_BASE                    RNG_BASE_NS

#define PKA                         PKA_NS
#define PKA_BASE                    PKA_BASE_NS

#define RAMCFG                      RAMCFG_NS
#define RAMCFG_BASE                 RAMCFG_BASE_NS

#define RAMCFG_SYSRAM               RAMCFG_SYSRAM_NS
#define RAMCFG_SYSRAM_BASE          RAMCFG_SYSRAM_BASE_NS

#define RAMCFG_SRAM1                RAMCFG_SRAM1_NS
#define RAMCFG_SRAM1_BASE           RAMCFG_SRAM1_BASE_NS

#define RAMCFG_SRAM2                RAMCFG_SRAM2_NS
#define RAMCFG_SRAM2_BASE           RAMCFG_SRAM2_BASE_NS

#define RAMCFG_RETRAM               RAMCFG_RETRAM_NS
#define RAMCFG_RETRAM_BASE          RAMCFG_RETRAM_BASE_NS

#define RAMCFG_BKPSRAM              RAMCFG_BKPSRAM_NS
#define RAMCFG_BKPSRAM_BASE         RAMCFG_BKPSRAM_BASE_NS

#define RAMCFG_VDERAM               RAMCFG_VDERAM_NS
#define RAMCFG_VDERAM_BASE          RAMCFG_VDERAM_BASE_NS

#define RIFSC                       RIFSC_NS
#define RIFSC_BASE                  RIFSC_BASE_NS

#define RISC                        RISC_NS
#define RISC_BASE                   RISC_BASE_NS

#define RIMC                        RIMC_NS
#define RIMC_BASE                   RIMC_BASE_NS

#define RIFSC_ID                    RIFSC_ID_NS
#define RIFSC_ID_BASE               RIFSC_ID_BASE_NS

#define IAC                         IAC_NS
#define IAC_BASE                    IAC_BASE_NS

#define RISAF1                      RISAF1_NS
#define RISAF1_BASE                 RISAF1_BASE_NS

#define RISAF2                      RISAF2_NS
#define RISAF2_BASE                 RISAF2_BASE_NS

#define RISAF4                      RISAF4_NS
#define RISAF4_BASE                 RISAF4_BASE_NS

#define RISAF5                      RISAF5_NS
#define RISAF5_BASE                 RISAF5_BASE_NS

#define RISAB1                      RISAB1_NS
#define RISAB1_BASE                 RISAB1_BASE_NS

#define RISAB2                      RISAB2_NS
#define RISAB2_BASE                 RISAB2_BASE_NS

#define RISAB3                      RISAB3_NS
#define RISAB3_BASE                 RISAB3_BASE_NS

#define RISAB4                      RISAB4_NS
#define RISAB4_BASE                 RISAB4_BASE_NS

#define RISAB5                      RISAB5_NS
#define RISAB5_BASE                 RISAB5_BASE_NS

#define RISAB6                      RISAB6_NS
#define RISAB6_BASE                 RISAB6_BASE_NS

/*!< APB3 peripherals defaults to Non secure aliases */
#define BSEC                        BSEC_NS
#define BSEC_BASE                   BSEC_BASE_NS

#define IWDG1                       IWDG1_NS
#define IWDG1_BASE                  IWDG1_BASE_NS

#define IWDG2                       IWDG2_NS
#define IWDG2_BASE                  IWDG2_BASE_NS

#define IWDG3                       IWDG3_NS
#define IWDG3_BASE                  IWDG3_BASE_NS

#define IWDG4                       IWDG4_NS
#define IWDG4_BASE                  IWDG4_BASE_NS

#define WWDG1                       WWDG1_NS
#define WWDG1_BASE                  WWDG1_BASE_NS

#define VREFBUF                     VREFBUF_NS
#define VREFBUF_BASE                VREFBUF_BASE_NS

#define DTS                         DTS_NS
#define DTS_BASE                    DTS_BASE_NS

#define SERC                        SERC_NS
#define SERC_BASE                   SERC_BASE_NS

#define HDP                         HDP_NS
#define HDP_BASE                    HDP_BASE_NS

/*!< AHB4 peripherals defaults to Non secure aliases */
#define RCC                         RCC_NS
#define RCC_BASE                    RCC_BASE_NS

#define PWR                         PWR_NS
#define PWR_BASE                    PWR_BASE_NS

#define EXTI1                       EXTI1_NS
#define EXTI1_BASE                  EXTI1_BASE_NS

#define EXTI1_C1                    EXTI1_C1_NS
#define EXTI1_C1_BASE               EXTI1_C1_BASE_NS

#define EXTI1_C2                    EXTI1_C2_NS
#define EXTI1_C2_BASE               EXTI1_C2_BASE_NS

#define SYSCFG                      SYSCFG_NS
#define SYSCFG_BASE                 SYSCFG_BASE_NS

#define GPIOA                       GPIOA_NS
#define GPIOA_BASE                  GPIOA_BASE_NS

#define GPIOB                       GPIOB_NS
#define GPIOB_BASE                  GPIOB_BASE_NS

#define GPIOC                       GPIOC_NS
#define GPIOC_BASE                  GPIOC_BASE_NS

#define GPIOD                       GPIOD_NS
#define GPIOD_BASE                  GPIOD_BASE_NS

#define GPIOE                       GPIOE_NS
#define GPIOE_BASE                  GPIOE_BASE_NS

#define GPIOF                       GPIOF_NS
#define GPIOF_BASE                  GPIOF_BASE_NS

#define GPIOG                       GPIOG_NS
#define GPIOG_BASE                  GPIOG_BASE_NS

#define GPIOH                       GPIOH_NS
#define GPIOH_BASE                  GPIOH_BASE_NS

#define GPIOI                       GPIOI_NS
#define GPIOI_BASE                  GPIOI_BASE_NS

#define GPIOJ                       GPIOJ_NS
#define GPIOJ_BASE                  GPIOJ_BASE_NS

#define GPIOK                       GPIOK_NS
#define GPIOK_BASE                  GPIOK_BASE_NS

/*!< SMART_RUN_APB peripherals defaults to Non secure aliases */
#define RTC                         RTC_NS
#define RTC_BASE                    RTC_BASE_NS

#define TAMP                        TAMP_NS
#define TAMP_BASE                   TAMP_BASE_NS

#define SPI8                        SPI8_NS
#define SPI8_BASE                   SPI8_BASE_NS

#define LPUART1                     LPUART1_NS
#define LPUART1_BASE                LPUART1_BASE_NS

