STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231axx_cm33.h
/********************  Bit definition for APBSRFZ register  *******************/
#define DBGMCU_APBSRFZ_DBG_RTC_STOP_Pos             (0U)
#define DBGMCU_APBSRFZ_DBG_RTC_STOP_Msk             (0x1UL << DBGMCU_APBSRFZ_DBG_RTC_STOP_Pos)           /*!< 0x00000001 */
#define DBGMCU_APBSRFZ_DBG_RTC_STOP                 DBGMCU_APBSRFZ_DBG_RTC_STOP_Msk                     /*!< RTC suspend in debug */
#define DBGMCU_APBSRFZ_DBG_I2C8_STOP_Pos            (4U)
#define DBGMCU_APBSRFZ_DBG_I2C8_STOP_Msk            (0x1UL << DBGMCU_APBSRFZ_DBG_I2C8_STOP_Pos)          /*!< 0x00000010 */
#define DBGMCU_APBSRFZ_DBG_I2C8_STOP                DBGMCU_APBSRFZ_DBG_I2C8_STOP_Msk                    /*!< I2C8 suspend in debug */
#define DBGMCU_APBSRFZ_DBG_LPTIM3_STOP_Pos          (5U)
#define DBGMCU_APBSRFZ_DBG_LPTIM3_STOP_Msk          (0x1UL << DBGMCU_APBSRFZ_DBG_LPTIM3_STOP_Pos)        /*!< 0x00000020 */
#define DBGMCU_APBSRFZ_DBG_LPTIM3_STOP              DBGMCU_APBSRFZ_DBG_LPTIM3_STOP_Msk                  /*!< LPTIM3 suspend in debug */
#define DBGMCU_APBSRFZ_DBG_LPTIM4_STOP_Pos          (6U)
#define DBGMCU_APBSRFZ_DBG_LPTIM4_STOP_Msk          (0x1UL << DBGMCU_APBSRFZ_DBG_LPTIM4_STOP_Pos)        /*!< 0x00000040 */
#define DBGMCU_APBSRFZ_DBG_LPTIM4_STOP              DBGMCU_APBSRFZ_DBG_LPTIM4_STOP_Msk                  /*!< LPTIM4 suspend in debug */
#define DBGMCU_APBSRFZ_DBG_LPTIM5_STOP_Pos          (7U)
#define DBGMCU_APBSRFZ_DBG_LPTIM5_STOP_Msk          (0x1UL << DBGMCU_APBSRFZ_DBG_LPTIM5_STOP_Pos)        /*!< 0x00000080 */
#define DBGMCU_APBSRFZ_DBG_LPTIM5_STOP              DBGMCU_APBSRFZ_DBG_LPTIM5_STOP_Msk                  /*!< LPTIM5 suspend in debug */
#define DBGMCU_APBSRFZ_DBG_I3C4_STOP_Pos            (8U)
#define DBGMCU_APBSRFZ_DBG_I3C4_STOP_Msk            (0x1UL << DBGMCU_APBSRFZ_DBG_I3C4_STOP_Pos)          /*!< 0x00000100 */
#define DBGMCU_APBSRFZ_DBG_I3C4_STOP                DBGMCU_APBSRFZ_DBG_I3C4_STOP_Msk                    /*!< I3C4 suspend in debug */
#define DBGMCU_APBSRFZ_DBG_IWDG5_STOP_Pos           (9U)
#define DBGMCU_APBSRFZ_DBG_IWDG5_STOP_Msk           (0x1UL << DBGMCU_APBSRFZ_DBG_IWDG5_STOP_Pos)         /*!< 0x00000200 */
#define DBGMCU_APBSRFZ_DBG_IWDG5_STOP               DBGMCU_APBSRFZ_DBG_IWDG5_STOP_Msk                   /*!< IWDG5 suspend in debug */
#define DBGMCU_APBSRFZ_DBG_WWDG2_STOP_Pos           (10U)
#define DBGMCU_APBSRFZ_DBG_WWDG2_STOP_Msk           (0x1UL << DBGMCU_APBSRFZ_DBG_WWDG2_STOP_Pos)         /*!< 0x00000400 */
#define DBGMCU_APBSRFZ_DBG_WWDG2_STOP               DBGMCU_APBSRFZ_DBG_WWDG2_STOP_Msk                   /*!< WWDG2 suspend in debug */

/******************************************************************************/
/*                                                                            */
/*                            DCACHE unit (DCACHE)                            */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for DCACHE_CR register  *******************/
#define DCACHE_CR_EN_Pos                    (0U)
#define DCACHE_CR_EN_Msk                    (0x1UL << DCACHE_CR_EN_Pos)                      /*!< 0x00000001 */
#define DCACHE_CR_EN                        DCACHE_CR_EN_Msk                                /*!< enable */
#define DCACHE_CR_CACHEINV_Pos              (1U)
#define DCACHE_CR_CACHEINV_Msk              (0x1UL << DCACHE_CR_CACHEINV_Pos)                /*!< 0x00000002 */
#define DCACHE_CR_CACHEINV                  DCACHE_CR_CACHEINV_Msk                          /*!< full cache invalidation */
#define DCACHE_CR_CACHECMD_Pos              (8U)
#define DCACHE_CR_CACHECMD_Msk              (0x7UL << DCACHE_CR_CACHECMD_Pos)                /*!< 0x00000700 */
#define DCACHE_CR_CACHECMD                  DCACHE_CR_CACHECMD_Msk                          /*!< cache command maintenance operation (cleans and/or invalidates an address range) */
#define DCACHE_CR_CACHECMD_0                (0x1UL << DCACHE_CR_CACHECMD_Pos)              /*!< 0x00000100 */
#define DCACHE_CR_CACHECMD_1                (0x2UL << DCACHE_CR_CACHECMD_Pos)              /*!< 0x00000200 */
#define DCACHE_CR_CACHECMD_2                (0x4UL << DCACHE_CR_CACHECMD_Pos)              /*!< 0x00000400 */
#define DCACHE_CR_STARTCMD_Pos              (11U)
#define DCACHE_CR_STARTCMD_Msk              (0x1UL << DCACHE_CR_STARTCMD_Pos)                /*!< 0x00000800 */
#define DCACHE_CR_STARTCMD                  DCACHE_CR_STARTCMD_Msk                          /*!< starts maintenance command (maintenance operation defined in CACHECMD). */
#define DCACHE_CR_RHITMEN_Pos               (16U)
#define DCACHE_CR_RHITMEN_Msk               (0x1UL << DCACHE_CR_RHITMEN_Pos)                 /*!< 0x00010000 */
#define DCACHE_CR_RHITMEN                   DCACHE_CR_RHITMEN_Msk                           /*!< read-hit monitor enable */
#define DCACHE_CR_RMISSMEN_Pos              (17U)
#define DCACHE_CR_RMISSMEN_Msk              (0x1UL << DCACHE_CR_RMISSMEN_Pos)                /*!< 0x00020000 */
#define DCACHE_CR_RMISSMEN                  DCACHE_CR_RMISSMEN_Msk                          /*!< read-miss monitor enable */
#define DCACHE_CR_RHITMRST_Pos              (18U)
#define DCACHE_CR_RHITMRST_Msk              (0x1UL << DCACHE_CR_RHITMRST_Pos)                /*!< 0x00040000 */
#define DCACHE_CR_RHITMRST                  DCACHE_CR_RHITMRST_Msk                          /*!< read-hit monitor reset */
#define DCACHE_CR_RMISSMRST_Pos             (19U)
#define DCACHE_CR_RMISSMRST_Msk             (0x1UL << DCACHE_CR_RMISSMRST_Pos)               /*!< 0x00080000 */
#define DCACHE_CR_RMISSMRST                 DCACHE_CR_RMISSMRST_Msk                         /*!< read-miss monitor reset */
#define DCACHE_CR_WHITMEN_Pos               (20U)
#define DCACHE_CR_WHITMEN_Msk               (0x1UL << DCACHE_CR_WHITMEN_Pos)                 /*!< 0x00100000 */
#define DCACHE_CR_WHITMEN                   DCACHE_CR_WHITMEN_Msk                           /*!< write-hit monitor enable */
#define DCACHE_CR_WMISSMEN_Pos              (21U)
#define DCACHE_CR_WMISSMEN_Msk              (0x1UL << DCACHE_CR_WMISSMEN_Pos)                /*!< 0x00200000 */
#define DCACHE_CR_WMISSMEN                  DCACHE_CR_WMISSMEN_Msk                          /*!< write-miss monitor enable */
#define DCACHE_CR_WHITMRST_Pos              (22U)
#define DCACHE_CR_WHITMRST_Msk              (0x1UL << DCACHE_CR_WHITMRST_Pos)                /*!< 0x00400000 */
#define DCACHE_CR_WHITMRST                  DCACHE_CR_WHITMRST_Msk                          /*!< write-hit monitor reset */
#define DCACHE_CR_WMISSMRST_Pos             (23U)
#define DCACHE_CR_WMISSMRST_Msk             (0x1UL << DCACHE_CR_WMISSMRST_Pos)               /*!< 0x00800000 */
#define DCACHE_CR_WMISSMRST                 DCACHE_CR_WMISSMRST_Msk                         /*!< write-miss monitor reset */
#define DCACHE_CR_HBURST_Pos                (31U)
#define DCACHE_CR_HBURST_Msk                (0x1UL << DCACHE_CR_HBURST_Pos)                  /*!< 0x80000000 */
#define DCACHE_CR_HBURST                    DCACHE_CR_HBURST_Msk                            /*!< output burst type for cache master port read accesses */

