STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231axx_cm33.h
/******************  Bit definition for IWDG_EWCR register  *******************/
#define IWDG_EWCR_EWIT_Pos          (0U)
#define IWDG_EWCR_EWIT_Msk          (0xFFFUL << IWDG_EWCR_EWIT_Pos)        /*!< 0x00000FFF */
#define IWDG_EWCR_EWIT              IWDG_EWCR_EWIT_Msk                    /*!< Watchdog counter window value */
#define IWDG_EWCR_EWIE_Pos          (15U)
#define IWDG_EWCR_EWIE_Msk          (0x1UL << IWDG_EWCR_EWIE_Pos)          /*!< 0x00008000 */
#define IWDG_EWCR_EWIE              IWDG_EWCR_EWIE_Msk                    /*!< Watchdog early interrupt enable */

/*******************  Bit definition for IWDG_ICR register  *******************/
#define IWDG_ICR_EWIC_Pos           (15U)
#define IWDG_ICR_EWIC_Msk           (0x1UL << IWDG_ICR_EWIC_Pos)           /*!< 0x00008000 */
#define IWDG_ICR_EWIC               IWDG_ICR_EWIC_Msk                     /*!< Watchdog early interrupt acknowledge */

/*****************  Bit definition for IWDG_HWCFGR register  ******************/
#define IWDG_HWCFGR_WINDOW_Pos      (0U)
#define IWDG_HWCFGR_WINDOW_Msk      (0xFUL << IWDG_HWCFGR_WINDOW_Pos)      /*!< 0x0000000F */
#define IWDG_HWCFGR_WINDOW          IWDG_HWCFGR_WINDOW_Msk                /*!< Support of Window function */
#define IWDG_HWCFGR_PR_DEFAULT_Pos  (4U)
#define IWDG_HWCFGR_PR_DEFAULT_Msk  (0xFUL << IWDG_HWCFGR_PR_DEFAULT_Pos)  /*!< 0x000000F0 */
#define IWDG_HWCFGR_PR_DEFAULT      IWDG_HWCFGR_PR_DEFAULT_Msk            /*!< Prescaler default value */

/******************  Bit definition for IWDG_VERR register  *******************/
#define IWDG_VERR_MINREV_Pos        (0U)
#define IWDG_VERR_MINREV_Msk        (0xFUL << IWDG_VERR_MINREV_Pos)        /*!< 0x0000000F */
#define IWDG_VERR_MINREV            IWDG_VERR_MINREV_Msk                  /*!< Minor revision */
#define IWDG_VERR_MAJREV_Pos        (4U)
#define IWDG_VERR_MAJREV_Msk        (0xFUL << IWDG_VERR_MAJREV_Pos)        /*!< 0x000000F0 */
#define IWDG_VERR_MAJREV            IWDG_VERR_MAJREV_Msk                  /*!< Major revision */

/*******************  Bit definition for IWDG_IDR register  *******************/
#define IWDG_IDR_ID_Pos             (0U)
#define IWDG_IDR_ID_Msk             (0xFFFFFFFFUL << IWDG_IDR_ID_Pos)      /*!< 0xFFFFFFFF */
#define IWDG_IDR_ID                 IWDG_IDR_ID_Msk                       /*!< IWDG identifier */

/******************  Bit definition for IWDG_SIDR register  *******************/
#define IWDG_SIDR_SID_Pos           (0U)
#define IWDG_SIDR_SID_Msk           (0xFFFFFFFFUL << IWDG_SIDR_SID_Pos)    /*!< 0xFFFFFFFF */
#define IWDG_SIDR_SID               IWDG_SIDR_SID_Msk                     /*!< IWDG size identifier */

/******************************************************************************/
/*                                                                            */
/*                          Low Power Timer (LPTIM)                           */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for LPTIM_ISR register  *******************/
#define LPTIM_ISR_CC1IF_Pos          (0U)
#define LPTIM_ISR_CC1IF_Msk          (0x1UL << LPTIM_ISR_CC1IF_Pos)           /*!< 0x00000001 */
#define LPTIM_ISR_CC1IF              LPTIM_ISR_CC1IF_Msk                     /*!< Capture/Compare 1 interrupt flag */
#define LPTIM_ISR_ARRM_Pos           (1U)
#define LPTIM_ISR_ARRM_Msk           (0x1UL << LPTIM_ISR_ARRM_Pos)            /*!< 0x00000002 */
#define LPTIM_ISR_ARRM               LPTIM_ISR_ARRM_Msk                      /*!< Autoreload match */
#define LPTIM_ISR_EXTTRIG_Pos        (2U)
#define LPTIM_ISR_EXTTRIG_Msk        (0x1UL << LPTIM_ISR_EXTTRIG_Pos)         /*!< 0x00000004 */
#define LPTIM_ISR_EXTTRIG            LPTIM_ISR_EXTTRIG_Msk                   /*!< External trigger edge event */
#define LPTIM_ISR_CMP1OK_Pos         (3U)
#define LPTIM_ISR_CMP1OK_Msk         (0x1UL << LPTIM_ISR_CMP1OK_Pos)          /*!< 0x00000008 */
#define LPTIM_ISR_CMP1OK             LPTIM_ISR_CMP1OK_Msk                    /*!< Compare register 1 update OK */
#define LPTIM_ISR_ARROK_Pos          (4U)
#define LPTIM_ISR_ARROK_Msk          (0x1UL << LPTIM_ISR_ARROK_Pos)           /*!< 0x00000010 */
#define LPTIM_ISR_ARROK              LPTIM_ISR_ARROK_Msk                     /*!< Autoreload register update OK */
#define LPTIM_ISR_UP_Pos             (5U)
#define LPTIM_ISR_UP_Msk             (0x1UL << LPTIM_ISR_UP_Pos)              /*!< 0x00000020 */
#define LPTIM_ISR_UP                 LPTIM_ISR_UP_Msk                        /*!< Counter direction change down to up */
#define LPTIM_ISR_DOWN_Pos           (6U)
#define LPTIM_ISR_DOWN_Msk           (0x1UL << LPTIM_ISR_DOWN_Pos)            /*!< 0x00000040 */
#define LPTIM_ISR_DOWN               LPTIM_ISR_DOWN_Msk                      /*!< Counter direction change up to down */
#define LPTIM_ISR_UE_Pos             (7U)
#define LPTIM_ISR_UE_Msk             (0x1UL << LPTIM_ISR_UE_Pos)              /*!< 0x00000080 */
#define LPTIM_ISR_UE                 LPTIM_ISR_UE_Msk                        /*!< LPTIM update event occurred */
#define LPTIM_ISR_REPOK_Pos          (8U)
#define LPTIM_ISR_REPOK_Msk          (0x1UL << LPTIM_ISR_REPOK_Pos)           /*!< 0x00000100 */
#define LPTIM_ISR_REPOK              LPTIM_ISR_REPOK_Msk                     /*!< Repetition register update OK */
#define LPTIM_ISR_CC2IF_Pos          (9U)
#define LPTIM_ISR_CC2IF_Msk          (0x1UL << LPTIM_ISR_CC2IF_Pos)           /*!< 0x00000200 */
#define LPTIM_ISR_CC2IF              LPTIM_ISR_CC2IF_Msk                     /*!< Capture/Compare 2 interrupt flag */
#define LPTIM_ISR_CC1OF_Pos          (12U)
#define LPTIM_ISR_CC1OF_Msk          (0x1UL << LPTIM_ISR_CC1OF_Pos)           /*!< 0x00001000 */
#define LPTIM_ISR_CC1OF              LPTIM_ISR_CC1OF_Msk                     /*!< Capture 1 over-capture flag */
#define LPTIM_ISR_CC2OF_Pos          (13U)
#define LPTIM_ISR_CC2OF_Msk          (0x1UL << LPTIM_ISR_CC2OF_Pos)           /*!< 0x00002000 */
#define LPTIM_ISR_CC2OF              LPTIM_ISR_CC2OF_Msk                     /*!< Capture 2 over-capture flag */
#define LPTIM_ISR_CMP2OK_Pos         (19U)
#define LPTIM_ISR_CMP2OK_Msk         (0x1UL << LPTIM_ISR_CMP2OK_Pos)          /*!< 0x00080000 */
#define LPTIM_ISR_CMP2OK             LPTIM_ISR_CMP2OK_Msk                    /*!< Compare register 2 update OK */
#define LPTIM_ISR_DIEROK_Pos         (24U)
#define LPTIM_ISR_DIEROK_Msk         (0x1UL << LPTIM_ISR_DIEROK_Pos)          /*!< 0x01000000 */
#define LPTIM_ISR_DIEROK             LPTIM_ISR_DIEROK_Msk                    /*!< Interrupt enable register update OK */

/******************  Bit definition for LPTIM_ICR register  *******************/
#define LPTIM_ICR_CC1CF_Pos          (0U)
#define LPTIM_ICR_CC1CF_Msk          (0x1UL << LPTIM_ICR_CC1CF_Pos)           /*!< 0x00000001 */
#define LPTIM_ICR_CC1CF              LPTIM_ICR_CC1CF_Msk                     /*!< Capture/compare 1 clear flag */
#define LPTIM_ICR_ARRMCF_Pos         (1U)
#define LPTIM_ICR_ARRMCF_Msk         (0x1UL << LPTIM_ICR_ARRMCF_Pos)          /*!< 0x00000002 */
#define LPTIM_ICR_ARRMCF             LPTIM_ICR_ARRMCF_Msk                    /*!< Autoreload match clear flag */
#define LPTIM_ICR_EXTTRIGCF_Pos      (2U)
#define LPTIM_ICR_EXTTRIGCF_Msk      (0x1UL << LPTIM_ICR_EXTTRIGCF_Pos)       /*!< 0x00000004 */
#define LPTIM_ICR_EXTTRIGCF          LPTIM_ICR_EXTTRIGCF_Msk                 /*!< External trigger valid edge clear flag */
#define LPTIM_ICR_CMP1OKCF_Pos       (3U)
#define LPTIM_ICR_CMP1OKCF_Msk       (0x1UL << LPTIM_ICR_CMP1OKCF_Pos)        /*!< 0x00000008 */
#define LPTIM_ICR_CMP1OKCF           LPTIM_ICR_CMP1OKCF_Msk                  /*!< Compare register 1 update OK clear flag */
#define LPTIM_ICR_ARROKCF_Pos        (4U)
#define LPTIM_ICR_ARROKCF_Msk        (0x1UL << LPTIM_ICR_ARROKCF_Pos)         /*!< 0x00000010 */
#define LPTIM_ICR_ARROKCF            LPTIM_ICR_ARROKCF_Msk                   /*!< Autoreload register update OK clear flag */
#define LPTIM_ICR_UPCF_Pos           (5U)
#define LPTIM_ICR_UPCF_Msk           (0x1UL << LPTIM_ICR_UPCF_Pos)            /*!< 0x00000020 */
#define LPTIM_ICR_UPCF               LPTIM_ICR_UPCF_Msk                      /*!< Direction change to UP clear flag */
#define LPTIM_ICR_DOWNCF_Pos         (6U)
#define LPTIM_ICR_DOWNCF_Msk         (0x1UL << LPTIM_ICR_DOWNCF_Pos)          /*!< 0x00000040 */
#define LPTIM_ICR_DOWNCF             LPTIM_ICR_DOWNCF_Msk                    /*!< Direction change to down clear flag */
#define LPTIM_ICR_UECF_Pos           (7U)
#define LPTIM_ICR_UECF_Msk           (0x1UL << LPTIM_ICR_UECF_Pos)            /*!< 0x00000080 */
#define LPTIM_ICR_UECF               LPTIM_ICR_UECF_Msk                      /*!< Update event clear flag */
#define LPTIM_ICR_REPOKCF_Pos        (8U)
#define LPTIM_ICR_REPOKCF_Msk        (0x1UL << LPTIM_ICR_REPOKCF_Pos)         /*!< 0x00000100 */
#define LPTIM_ICR_REPOKCF            LPTIM_ICR_REPOKCF_Msk                   /*!< Repetition register update OK clear flag */
#define LPTIM_ICR_CC2CF_Pos          (9U)
#define LPTIM_ICR_CC2CF_Msk          (0x1UL << LPTIM_ICR_CC2CF_Pos)           /*!< 0x00000200 */
#define LPTIM_ICR_CC2CF              LPTIM_ICR_CC2CF_Msk                     /*!< Capture/compare 2 clear flag */
#define LPTIM_ICR_CC1OCF_Pos         (12U)
#define LPTIM_ICR_CC1OCF_Msk         (0x1UL << LPTIM_ICR_CC1OCF_Pos)          /*!< 0x00001000 */
#define LPTIM_ICR_CC1OCF             LPTIM_ICR_CC1OCF_Msk                    /*!< Capture/compare 1 over-capture clear flag */
#define LPTIM_ICR_CC2OCF_Pos         (13U)
#define LPTIM_ICR_CC2OCF_Msk         (0x1UL << LPTIM_ICR_CC2OCF_Pos)          /*!< 0x00002000 */
#define LPTIM_ICR_CC2OCF             LPTIM_ICR_CC2OCF_Msk                    /*!< Capture/compare 2 over-capture clear flag */
#define LPTIM_ICR_CMP2OKCF_Pos       (19U)
#define LPTIM_ICR_CMP2OKCF_Msk       (0x1UL << LPTIM_ICR_CMP2OKCF_Pos)        /*!< 0x00080000 */
#define LPTIM_ICR_CMP2OKCF           LPTIM_ICR_CMP2OKCF_Msk                  /*!< Compare register 2 update OK clear flag */
#define LPTIM_ICR_DIEROKCF_Pos       (24U)
#define LPTIM_ICR_DIEROKCF_Msk       (0x1UL << LPTIM_ICR_DIEROKCF_Pos)        /*!< 0x01000000 */
#define LPTIM_ICR_DIEROKCF           LPTIM_ICR_DIEROKCF_Msk                  /*!< Interrupt enable register update OK clear flag */

/*****************  Bit definition for LPTIM_DIER register  *******************/
#define LPTIM_DIER_CC1IE_Pos         (0U)
#define LPTIM_DIER_CC1IE_Msk         (0x1UL << LPTIM_DIER_CC1IE_Pos)          /*!< 0x00000001 */
#define LPTIM_DIER_CC1IE             LPTIM_DIER_CC1IE_Msk                    /*!< Capture/compare 1 interrupt enable */
#define LPTIM_DIER_ARRMIE_Pos        (1U)
#define LPTIM_DIER_ARRMIE_Msk        (0x1UL << LPTIM_DIER_ARRMIE_Pos)         /*!< 0x00000002 */
#define LPTIM_DIER_ARRMIE            LPTIM_DIER_ARRMIE_Msk                   /*!< Autoreload match Interrupt Enable */
#define LPTIM_DIER_EXTTRIGIE_Pos     (2U)
#define LPTIM_DIER_EXTTRIGIE_Msk     (0x1UL << LPTIM_DIER_EXTTRIGIE_Pos)      /*!< 0x00000004 */
#define LPTIM_DIER_EXTTRIGIE         LPTIM_DIER_EXTTRIGIE_Msk                /*!< External trigger valid edge Interrupt Enable */
#define LPTIM_DIER_CMP1OKIE_Pos      (3U)
#define LPTIM_DIER_CMP1OKIE_Msk      (0x1UL << LPTIM_DIER_CMP1OKIE_Pos)       /*!< 0x00000008 */
#define LPTIM_DIER_CMP1OKIE          LPTIM_DIER_CMP1OKIE_Msk                 /*!< Compare register 1 update OK interrupt enable */
#define LPTIM_DIER_ARROKIE_Pos       (4U)
#define LPTIM_DIER_ARROKIE_Msk       (0x1UL << LPTIM_DIER_ARROKIE_Pos)        /*!< 0x00000010 */
#define LPTIM_DIER_ARROKIE           LPTIM_DIER_ARROKIE_Msk                  /*!< Autoreload register update OK Interrupt Enable */
#define LPTIM_DIER_UPIE_Pos          (5U)
#define LPTIM_DIER_UPIE_Msk          (0x1UL << LPTIM_DIER_UPIE_Pos)           /*!< 0x00000020 */
#define LPTIM_DIER_UPIE              LPTIM_DIER_UPIE_Msk                     /*!< Direction change to UP Interrupt Enable */
#define LPTIM_DIER_DOWNIE_Pos        (6U)
#define LPTIM_DIER_DOWNIE_Msk        (0x1UL << LPTIM_DIER_DOWNIE_Pos)         /*!< 0x00000040 */
#define LPTIM_DIER_DOWNIE            LPTIM_DIER_DOWNIE_Msk                   /*!< Direction change to down Interrupt Enable */
#define LPTIM_DIER_UEIE_Pos          (7U)
#define LPTIM_DIER_UEIE_Msk          (0x1UL << LPTIM_DIER_UEIE_Pos)           /*!< 0x00000080 */
#define LPTIM_DIER_UEIE              LPTIM_DIER_UEIE_Msk                     /*!< Update event interrupt enable */
#define LPTIM_DIER_REPOKIE_Pos       (8U)
#define LPTIM_DIER_REPOKIE_Msk       (0x1UL << LPTIM_DIER_REPOKIE_Pos)        /*!< 0x00000100 */
#define LPTIM_DIER_REPOKIE           LPTIM_DIER_REPOKIE_Msk                  /*!< Repetition register update OK interrupt Enable */
#define LPTIM_DIER_CC2IE_Pos         (9U)
#define LPTIM_DIER_CC2IE_Msk         (0x1UL << LPTIM_DIER_CC2IE_Pos)          /*!< 0x00000200 */
#define LPTIM_DIER_CC2IE             LPTIM_DIER_CC2IE_Msk                    /*!< Capture/compare 2 interrupt enable */
#define LPTIM_DIER_CC1OIE_Pos        (12U)
#define LPTIM_DIER_CC1OIE_Msk        (0x1UL << LPTIM_DIER_CC1OIE_Pos)         /*!< 0x00001000 */
#define LPTIM_DIER_CC1OIE            LPTIM_DIER_CC1OIE_Msk                   /*!< Capture/compare 1 over-capture interrupt enable */
#define LPTIM_DIER_CC2OIE_Pos        (13U)
#define LPTIM_DIER_CC2OIE_Msk        (0x1UL << LPTIM_DIER_CC2OIE_Pos)         /*!< 0x00002000 */
#define LPTIM_DIER_CC2OIE            LPTIM_DIER_CC2OIE_Msk                   /*!< Capture/compare 2 over-capture interrupt enable */
#define LPTIM_DIER_CC1DE_Pos         (16U)
#define LPTIM_DIER_CC1DE_Msk         (0x1UL << LPTIM_DIER_CC1DE_Pos)          /*!< 0x00010000 */
#define LPTIM_DIER_CC1DE             LPTIM_DIER_CC1DE_Msk                    /*!< Capture/compare 1 DMA request enable */
#define LPTIM_DIER_CMP2OKIE_Pos      (19U)
#define LPTIM_DIER_CMP2OKIE_Msk      (0x1UL << LPTIM_DIER_CMP2OKIE_Pos)       /*!< 0x00080000 */
#define LPTIM_DIER_CMP2OKIE          LPTIM_DIER_CMP2OKIE_Msk                 /*!< Compare register 2 update OK interrupt enable */
#define LPTIM_DIER_UEDE_Pos          (23U)
#define LPTIM_DIER_UEDE_Msk          (0x1UL << LPTIM_DIER_UEDE_Pos)           /*!< 0x00800000 */
#define LPTIM_DIER_UEDE              LPTIM_DIER_UEDE_Msk                     /*!< Update event DMA request enable */
#define LPTIM_DIER_CC2DE_Pos         (25U)
#define LPTIM_DIER_CC2DE_Msk         (0x1UL << LPTIM_DIER_CC2DE_Pos)          /*!< 0x02000000 */
#define LPTIM_DIER_CC2DE             LPTIM_DIER_CC2DE_Msk                    /*!< Capture/compare 2 DMA request enable */

/******************  Bit definition for LPTIM_CFGR register  ******************/
#define LPTIM_CFGR_CKSEL_Pos         (0U)
#define LPTIM_CFGR_CKSEL_Msk         (0x1UL << LPTIM_CFGR_CKSEL_Pos)          /*!< 0x00000001 */
#define LPTIM_CFGR_CKSEL             LPTIM_CFGR_CKSEL_Msk                    /*!< Clock selector */
#define LPTIM_CFGR_CKPOL_Pos         (1U)
#define LPTIM_CFGR_CKPOL_Msk         (0x3UL << LPTIM_CFGR_CKPOL_Pos)          /*!< 0x00000006 */
#define LPTIM_CFGR_CKPOL             LPTIM_CFGR_CKPOL_Msk                    /*!< Clock Polarity */
#define LPTIM_CFGR_CKPOL_0           (0x1UL << LPTIM_CFGR_CKPOL_Pos)          /*!< 0x00000002 */
#define LPTIM_CFGR_CKPOL_1           (0x2UL << LPTIM_CFGR_CKPOL_Pos)          /*!< 0x00000004 */
#define LPTIM_CFGR_CKFLT_Pos         (3U)
#define LPTIM_CFGR_CKFLT_Msk         (0x3UL << LPTIM_CFGR_CKFLT_Pos)          /*!< 0x00000018 */
#define LPTIM_CFGR_CKFLT             LPTIM_CFGR_CKFLT_Msk                    /*!< Configurable digital filter for external clock */
#define LPTIM_CFGR_CKFLT_0           (0x1UL << LPTIM_CFGR_CKFLT_Pos)          /*!< 0x00000008 */
#define LPTIM_CFGR_CKFLT_1           (0x2UL << LPTIM_CFGR_CKFLT_Pos)          /*!< 0x00000010 */
#define LPTIM_CFGR_TRGFLT_Pos        (6U)
#define LPTIM_CFGR_TRGFLT_Msk        (0x3UL << LPTIM_CFGR_TRGFLT_Pos)         /*!< 0x000000C0 */
#define LPTIM_CFGR_TRGFLT            LPTIM_CFGR_TRGFLT_Msk                   /*!< Configurable digital filter for trigger */
#define LPTIM_CFGR_TRGFLT_0          (0x1UL << LPTIM_CFGR_TRGFLT_Pos)         /*!< 0x00000040 */
#define LPTIM_CFGR_TRGFLT_1          (0x2UL << LPTIM_CFGR_TRGFLT_Pos)         /*!< 0x00000080 */
#define LPTIM_CFGR_PRESC_Pos         (9U)
#define LPTIM_CFGR_PRESC_Msk         (0x7UL << LPTIM_CFGR_PRESC_Pos)          /*!< 0x00000E00 */
#define LPTIM_CFGR_PRESC             LPTIM_CFGR_PRESC_Msk                    /*!< Clock prescaler */
#define LPTIM_CFGR_PRESC_0           (0x1UL << LPTIM_CFGR_PRESC_Pos)          /*!< 0x00000200 */
#define LPTIM_CFGR_PRESC_1           (0x2UL << LPTIM_CFGR_PRESC_Pos)          /*!< 0x00000400 */
#define LPTIM_CFGR_PRESC_2           (0x4UL << LPTIM_CFGR_PRESC_Pos)          /*!< 0x00000800 */
#define LPTIM_CFGR_TRIGSEL_Pos       (13U)
#define LPTIM_CFGR_TRIGSEL_Msk       (0x7UL << LPTIM_CFGR_TRIGSEL_Pos)        /*!< 0x0000E000 */
#define LPTIM_CFGR_TRIGSEL           LPTIM_CFGR_TRIGSEL_Msk                  /*!< Trigger selector */
#define LPTIM_CFGR_TRIGSEL_0         (0x1UL << LPTIM_CFGR_TRIGSEL_Pos)        /*!< 0x00002000 */
#define LPTIM_CFGR_TRIGSEL_1         (0x2UL << LPTIM_CFGR_TRIGSEL_Pos)        /*!< 0x00004000 */
#define LPTIM_CFGR_TRIGSEL_2         (0x4UL << LPTIM_CFGR_TRIGSEL_Pos)        /*!< 0x00008000 */
#define LPTIM_CFGR_TRIGEN_Pos        (17U)
#define LPTIM_CFGR_TRIGEN_Msk        (0x3UL << LPTIM_CFGR_TRIGEN_Pos)         /*!< 0x00060000 */
#define LPTIM_CFGR_TRIGEN            LPTIM_CFGR_TRIGEN_Msk                   /*!< Trigger enable and polarity */
#define LPTIM_CFGR_TRIGEN_0          (0x1UL << LPTIM_CFGR_TRIGEN_Pos)         /*!< 0x00020000 */
#define LPTIM_CFGR_TRIGEN_1        (  0x2UL << LPTIM_CFGR_TRIGEN_Pos)         /*!< 0x00040000 */
#define LPTIM_CFGR_TIMOUT_Pos        (19U)
#define LPTIM_CFGR_TIMOUT_Msk        (0x1UL << LPTIM_CFGR_TIMOUT_Pos)         /*!< 0x00080000 */
#define LPTIM_CFGR_TIMOUT            LPTIM_CFGR_TIMOUT_Msk                   /*!< Timeout enable */
#define LPTIM_CFGR_WAVE_Pos          (20U)
#define LPTIM_CFGR_WAVE_Msk          (0x1UL << LPTIM_CFGR_WAVE_Pos)           /*!< 0x00100000 */
#define LPTIM_CFGR_WAVE              LPTIM_CFGR_WAVE_Msk                     /*!< Waveform shape */
#define LPTIM_CFGR_WAVPOL_Pos        (21U)
#define LPTIM_CFGR_WAVPOL_Msk        (0x1UL << LPTIM_CFGR_WAVPOL_Pos)         /*!< 0x00200000 */
#define LPTIM_CFGR_WAVPOL            LPTIM_CFGR_WAVPOL_Msk                   /*!< Waveform shape polarity */
#define LPTIM_CFGR_PRELOAD_Pos       (22U)
#define LPTIM_CFGR_PRELOAD_Msk       (0x1UL << LPTIM_CFGR_PRELOAD_Pos)        /*!< 0x00400000 */
#define LPTIM_CFGR_PRELOAD           LPTIM_CFGR_PRELOAD_Msk                  /*!< Registers update mode */
#define LPTIM_CFGR_COUNTMODE_Pos     (23U)
#define LPTIM_CFGR_COUNTMODE_Msk     (0x1UL << LPTIM_CFGR_COUNTMODE_Pos)      /*!< 0x00800000 */
#define LPTIM_CFGR_COUNTMODE         LPTIM_CFGR_COUNTMODE_Msk                /*!< counter mode enabled */
#define LPTIM_CFGR_ENC_Pos           (24U)
#define LPTIM_CFGR_ENC_Msk           (0x1UL << LPTIM_CFGR_ENC_Pos)            /*!< 0x01000000 */
#define LPTIM_CFGR_ENC               LPTIM_CFGR_ENC_Msk                      /*!< Encoder mode enable */

/*******************  Bit definition for LPTIM_CR register  *******************/
#define LPTIM_CR_ENABLE_Pos          (0U)
#define LPTIM_CR_ENABLE_Msk          (0x1UL << LPTIM_CR_ENABLE_Pos)           /*!< 0x00000001 */
#define LPTIM_CR_ENABLE              LPTIM_CR_ENABLE_Msk                     /*!< LPTIM enable */
#define LPTIM_CR_SNGSTRT_Pos         (1U)
#define LPTIM_CR_SNGSTRT_Msk         (0x1UL << LPTIM_CR_SNGSTRT_Pos)          /*!< 0x00000002 */
#define LPTIM_CR_SNGSTRT             LPTIM_CR_SNGSTRT_Msk                    /*!< LPTIM start in Single mode */
#define LPTIM_CR_CNTSTRT_Pos         (2U)
#define LPTIM_CR_CNTSTRT_Msk         (0x1UL << LPTIM_CR_CNTSTRT_Pos)          /*!< 0x00000004 */
#define LPTIM_CR_CNTSTRT             LPTIM_CR_CNTSTRT_Msk                    /*!< Timer start in Continuous mode */
#define LPTIM_CR_COUNTRST_Pos        (3U)
#define LPTIM_CR_COUNTRST_Msk        (0x1UL << LPTIM_CR_COUNTRST_Pos)         /*!< 0x00000008 */
#define LPTIM_CR_COUNTRST            LPTIM_CR_COUNTRST_Msk                   /*!< Counter reset */
#define LPTIM_CR_RSTARE_Pos          (4U)
#define LPTIM_CR_RSTARE_Msk          (0x1UL << LPTIM_CR_RSTARE_Pos)           /*!< 0x00000010 */
#define LPTIM_CR_RSTARE              LPTIM_CR_RSTARE_Msk                     /*!< Reset after read enable */

