STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231axx_cm33.h
/****************  Bit definition for LPTIM_HWCFGR2 register  *****************/
#define LPTIM_HWCFGR2_CFG1_Pos       (0U)
#define LPTIM_HWCFGR2_CFG1_Msk       (0xFUL << LPTIM_HWCFGR2_CFG1_Pos)        /*!< 0x0000000F */
#define LPTIM_HWCFGR2_CFG1           LPTIM_HWCFGR2_CFG1_Msk                  /*!< peripheral hardware configuration 1 */
#define LPTIM_HWCFGR2_CFG2_Pos       (8U)
#define LPTIM_HWCFGR2_CFG2_Msk       (0xFFUL << LPTIM_HWCFGR2_CFG2_Pos)       /*!< 0x0000FF00 */
#define LPTIM_HWCFGR2_CFG2           LPTIM_HWCFGR2_CFG2_Msk                  /*!< peripheral hardware configuration 2 */
#define LPTIM_HWCFGR2_CFG3_Pos       (16U)
#define LPTIM_HWCFGR2_CFG3_Msk       (0x1UL << LPTIM_HWCFGR2_CFG3_Pos)        /*!< 0x00010000 */
#define LPTIM_HWCFGR2_CFG3           LPTIM_HWCFGR2_CFG3_Msk                  /*!< peripheral hardware configuration 3 */

/****************  Bit definition for LPTIM_HWCFGR1 register  *****************/
#define LPTIM_HWCFGR1_CFG1_Pos       (0U)
#define LPTIM_HWCFGR1_CFG1_Msk       (0xFFUL << LPTIM_HWCFGR1_CFG1_Pos)       /*!< 0x000000FF */
#define LPTIM_HWCFGR1_CFG1           LPTIM_HWCFGR1_CFG1_Msk                  /*!< peripheral hardware configuration 1 */
#define LPTIM_HWCFGR1_CFG2_Pos       (8U)
#define LPTIM_HWCFGR1_CFG2_Msk       (0xFFUL << LPTIM_HWCFGR1_CFG2_Pos)       /*!< 0x0000FF00 */
#define LPTIM_HWCFGR1_CFG2           LPTIM_HWCFGR1_CFG2_Msk                  /*!< peripheral hardware configuration 2 */
#define LPTIM_HWCFGR1_CFG3_Pos       (16U)
#define LPTIM_HWCFGR1_CFG3_Msk       (0xFUL << LPTIM_HWCFGR1_CFG3_Pos)        /*!< 0x000F0000 */
#define LPTIM_HWCFGR1_CFG3           LPTIM_HWCFGR1_CFG3_Msk                  /*!< peripheral hardware configuration 3 */
#define LPTIM_HWCFGR1_CFG4_Pos       (24U)
#define LPTIM_HWCFGR1_CFG4_Msk       (0xFFUL << LPTIM_HWCFGR1_CFG4_Pos)       /*!< 0xFF000000 */
#define LPTIM_HWCFGR1_CFG4           LPTIM_HWCFGR1_CFG4_Msk                  /*!< peripheral hardware configuration 4 */

/******************  Bit definition for LPTIM_VERR register  ******************/
#define LPTIM_VERR_MINREV_Pos        (0U)
#define LPTIM_VERR_MINREV_Msk        (0xFUL << LPTIM_VERR_MINREV_Pos)         /*!< 0x0000000F */
#define LPTIM_VERR_MINREV            LPTIM_VERR_MINREV_Msk                   /*!< Minor revision */
#define LPTIM_VERR_MAJREV_Pos        (4U)
#define LPTIM_VERR_MAJREV_Msk        (0xFUL << LPTIM_VERR_MAJREV_Pos)         /*!< 0x000000F0 */
#define LPTIM_VERR_MAJREV            LPTIM_VERR_MAJREV_Msk                   /*!< Major revision */

/******************  Bit definition for LPTIM_PIDR register  ******************/
#define LPTIM_PIDR_P_ID_Pos          (0U)
#define LPTIM_PIDR_P_ID_Msk          (0xFFFFFFFFUL << LPTIM_PIDR_P_ID_Pos)    /*!< 0xFFFFFFFF */
#define LPTIM_PIDR_P_ID              LPTIM_PIDR_P_ID_Msk                     /*!< Peripheral type identifier */

/******************  Bit definition for LPTIM_SIDR register  ******************/
#define LPTIM_SIDR_S_ID_Pos          (0U)
#define LPTIM_SIDR_S_ID_Msk          (0xFFFFFFFFUL << LPTIM_SIDR_S_ID_Pos)    /*!< 0xFFFFFFFF */
#define LPTIM_SIDR_S_ID              LPTIM_SIDR_S_ID_Msk                     /*!< Registers map size identifier */

/******************************************************************************/
/*                                                                            */
/*                      LCD-TFT Display Controller (LTDC)                     */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for LTDC_IDR register  *******************/
#define LTDC_IDR_REV_Pos              (0U)
#define LTDC_IDR_REV_Msk              (0xFFUL << LTDC_IDR_REV_Pos)/*!< 0x000000FF */
#define LTDC_IDR_REV                  LTDC_IDR_REV_Msk           /*!< revision */
#define LTDC_IDR_MINVER_Pos           (8U)
#define LTDC_IDR_MINVER_Msk           (0xFFUL << LTDC_IDR_MINVER_Pos)   /*!< 0x0000FF00 */
#define LTDC_IDR_MINVER               LTDC_IDR_MINVER_Msk        /*!< minor version */
#define LTDC_IDR_MAJVER_Pos           (16U)
#define LTDC_IDR_MAJVER_Msk           (0xFFUL << LTDC_IDR_MAJVER_Pos)   /*!< 0x00FF0000 */
#define LTDC_IDR_MAJVER               LTDC_IDR_MAJVER_Msk        /*!< major version */

/*******************  Bit definition for LTDC_LCR register  *******************/
#define LTDC_LCR_LNBR_Pos             (0U)
#define LTDC_LCR_LNBR_Msk             (0xFFUL << LTDC_LCR_LNBR_Pos) /*!< 0x000000FF */
#define LTDC_LCR_LNBR                 LTDC_LCR_LNBR_Msk          /*!< number of layers */

/******************  Bit definition for LTDC_SSCR register  *******************/
#define LTDC_SSCR_VSH_Pos             (0U)
#define LTDC_SSCR_VSH_Msk             (0xFFFFUL << LTDC_SSCR_VSH_Pos)   /*!< 0x0000FFFF */
#define LTDC_SSCR_VSH                 LTDC_SSCR_VSH_Msk          /*!< vertical synchronization height (in units of horizontal scan line) */
#define LTDC_SSCR_HSW_Pos             (16U)
#define LTDC_SSCR_HSW_Msk             (0xFFFFUL << LTDC_SSCR_HSW_Pos)   /*!< 0xFFFF0000 */
#define LTDC_SSCR_HSW                 LTDC_SSCR_HSW_Msk          /*!< horizontal synchronization width (in units of pixel clock period) */

/******************  Bit definition for LTDC_BPCR register  *******************/
#define LTDC_BPCR_AVBP_Pos            (0U)
#define LTDC_BPCR_AVBP_Msk            (0xFFFFUL << LTDC_BPCR_AVBP_Pos)    /*!< 0x0000FFFF */
#define LTDC_BPCR_AVBP                LTDC_BPCR_AVBP_Msk         /*!< accumulated Vertical back porch (in units of horizontal scan line) */
#define LTDC_BPCR_AHBP_Pos            (16U)
#define LTDC_BPCR_AHBP_Msk            (0xFFFFUL << LTDC_BPCR_AHBP_Pos)    /*!< 0xFFFF0000 */
#define LTDC_BPCR_AHBP                LTDC_BPCR_AHBP_Msk         /*!< accumulated horizontal back porch (in units of pixel clock period) */

/******************  Bit definition for LTDC_AWCR register  *******************/
#define LTDC_AWCR_AAH_Pos             (0U)
#define LTDC_AWCR_AAH_Msk             (0xFFFFUL << LTDC_AWCR_AAH_Pos)   /*!< 0x0000FFFF */
#define LTDC_AWCR_AAH                 LTDC_AWCR_AAH_Msk          /*!< accumulated active height (in units of horizontal scan line) */
#define LTDC_AWCR_AAW_Pos             (16U)
#define LTDC_AWCR_AAW_Msk             (0xFFFFUL << LTDC_AWCR_AAW_Pos)   /*!< 0xFFFF0000 */
#define LTDC_AWCR_AAW                 LTDC_AWCR_AAW_Msk          /*!< accumulated active width (in units of pixel clock period) */

/******************  Bit definition for LTDC_TWCR register  *******************/
#define LTDC_TWCR_TOTALH_Pos          (0U)
#define LTDC_TWCR_TOTALH_Msk          (0xFFFFUL << LTDC_TWCR_TOTALH_Pos)      /*!< 0x0000FFFF */
#define LTDC_TWCR_TOTALH              LTDC_TWCR_TOTALH_Msk       /*!< total height (in units of horizontal scan line) */
#define LTDC_TWCR_TOTALW_Pos          (16U)
#define LTDC_TWCR_TOTALW_Msk          (0xFFFFUL << LTDC_TWCR_TOTALW_Pos)      /*!< 0xFFFF0000 */
#define LTDC_TWCR_TOTALW              LTDC_TWCR_TOTALW_Msk       /*!< total width (in units of pixel clock period) */

/*******************  Bit definition for LTDC_GCR register  *******************/
#define LTDC_GCR_LTDCEN_Pos           (0U)
#define LTDC_GCR_LTDCEN_Msk           (0x1UL << LTDC_GCR_LTDCEN_Pos)  /*!< 0x00000001 */
#define LTDC_GCR_LTDCEN               LTDC_GCR_LTDCEN_Msk        /*!< LTDC global enable */
#define LTDC_GCR_GAMEN_Pos            (1U)
#define LTDC_GCR_GAMEN_Msk            (0x1UL << LTDC_GCR_GAMEN_Pos) /*!< 0x00000002 */
#define LTDC_GCR_GAMEN                LTDC_GCR_GAMEN_Msk         /*!< Gamma correction enable */
#define LTDC_GCR_ROTEN_Pos            (2U)
#define LTDC_GCR_ROTEN_Msk            (0x1UL << LTDC_GCR_ROTEN_Pos) /*!< 0x00000004 */
#define LTDC_GCR_ROTEN                LTDC_GCR_ROTEN_Msk         /*!< Rotation enable */
#define LTDC_GCR_DBW_Pos              (4U)
#define LTDC_GCR_DBW_Msk              (0x7UL << LTDC_GCR_DBW_Pos) /*!< 0x00000070 */
#define LTDC_GCR_DBW                  LTDC_GCR_DBW_Msk           /*!< dither blue width */
#define LTDC_GCR_DGW_Pos              (8U)
#define LTDC_GCR_DGW_Msk              (0x7UL << LTDC_GCR_DGW_Pos) /*!< 0x00000700 */
#define LTDC_GCR_DGW                  LTDC_GCR_DGW_Msk           /*!< dither green width */
#define LTDC_GCR_DRW_Pos              (12U)
#define LTDC_GCR_DRW_Msk              (0x7UL << LTDC_GCR_DRW_Pos) /*!< 0x00007000 */
#define LTDC_GCR_DRW                  LTDC_GCR_DRW_Msk           /*!< dither red width */
#define LTDC_GCR_DEN_Pos              (16U)
#define LTDC_GCR_DEN_Msk              (0x1UL << LTDC_GCR_DEN_Pos) /*!< 0x00010000 */
#define LTDC_GCR_DEN                  LTDC_GCR_DEN_Msk           /*!< dither enable */
#define LTDC_GCR_BCKEN_Pos            (17U)
#define LTDC_GCR_BCKEN_Msk            (0x1UL << LTDC_GCR_BCKEN_Pos) /*!< 0x00020000 */
#define LTDC_GCR_BCKEN                LTDC_GCR_BCKEN_Msk         /*!< background layer enable*/
#define LTDC_GCR_CRCEN_Pos            (19U)
#define LTDC_GCR_CRCEN_Msk            (0x1UL << LTDC_GCR_CRCEN_Pos) /*!< 0x00080000 */
#define LTDC_GCR_CRCEN                LTDC_GCR_CRCEN_Msk         /*!< CRC enable */
#define LTDC_GCR_SFEN_Pos             (24U)
#define LTDC_GCR_SFEN_Msk             (0x1UL << LTDC_GCR_SFEN_Pos)/*!< 0x01000000 */
#define LTDC_GCR_SFEN                 LTDC_GCR_SFEN_Msk          /*!< single-frame mode: mode enable */
#define LTDC_GCR_SFSWTR_Pos           (25U)
#define LTDC_GCR_SFSWTR_Msk           (0x1UL << LTDC_GCR_SFSWTR_Pos)  /*!< 0x02000000 */
#define LTDC_GCR_SFSWTR               LTDC_GCR_SFSWTR_Msk        /*!< single-frame mode: software trigger */
#define LTDC_GCR_SFEXEN_Pos           (26U)
#define LTDC_GCR_SFEXEN_Msk           (0x1UL << LTDC_GCR_SFEXEN_Pos)  /*!< 0x04000000 */
#define LTDC_GCR_SFEXEN               LTDC_GCR_SFEXEN_Msk        /*!< single-frame mode: external trigger enable */
#define LTDC_GCR_PCPOL_Pos            (28U)
#define LTDC_GCR_PCPOL_Msk            (0x1UL << LTDC_GCR_PCPOL_Pos) /*!< 0x10000000 */
#define LTDC_GCR_PCPOL                LTDC_GCR_PCPOL_Msk         /*!< pixel clock polarity */
#define LTDC_GCR_DEPOL_Pos            (29U)
#define LTDC_GCR_DEPOL_Msk            (0x1UL << LTDC_GCR_DEPOL_Pos) /*!< 0x20000000 */
#define LTDC_GCR_DEPOL                LTDC_GCR_DEPOL_Msk         /*!< blanking (no data/pixel) polarity */
#define LTDC_GCR_VSPOL_Pos            (30U)
#define LTDC_GCR_VSPOL_Msk            (0x1UL << LTDC_GCR_VSPOL_Pos) /*!< 0x40000000 */
#define LTDC_GCR_VSPOL                LTDC_GCR_VSPOL_Msk         /*!< vertical synchronization polarity */
#define LTDC_GCR_HSPOL_Pos            (31U)
#define LTDC_GCR_HSPOL_Msk            (0x1UL << LTDC_GCR_HSPOL_Pos) /*!< 0x80000000 */
#define LTDC_GCR_HSPOL                LTDC_GCR_HSPOL_Msk         /*!< horizontal synchronization polarity */

/******************  Bit definition for LTDC_GC1R register  *******************/
#define LTDC_GC1R_WBCH_Pos            (0U)
#define LTDC_GC1R_WBCH_Msk            (0xFUL << LTDC_GC1R_WBCH_Pos) /*!< 0x0000000F */
#define LTDC_GC1R_WBCH                LTDC_GC1R_WBCH_Msk         /*!< width of blue channel output */
#define LTDC_GC1R_WGCH_Pos            (4U)
#define LTDC_GC1R_WGCH_Msk            (0xFUL << LTDC_GC1R_WGCH_Pos) /*!< 0x000000F0 */
#define LTDC_GC1R_WGCH                LTDC_GC1R_WGCH_Msk         /*!< width of green channel output */
#define LTDC_GC1R_WRCH_Pos            (8U)
#define LTDC_GC1R_WRCH_Msk            (0xFUL << LTDC_GC1R_WRCH_Pos) /*!< 0x00000F00 */
#define LTDC_GC1R_WRCH                LTDC_GC1R_WRCH_Msk         /*!< width of red channel output */
#define LTDC_GC1R_PRBA_Pos            (12U)
#define LTDC_GC1R_PRBA_Msk            (0x1UL << LTDC_GC1R_PRBA_Pos) /*!< 0x00001000 */
#define LTDC_GC1R_PRBA                LTDC_GC1R_PRBA_Msk         /*!< precise blending ability */
#define LTDC_GC1R_DT_Pos              (14U)
#define LTDC_GC1R_DT_Msk              (0x3UL << LTDC_GC1R_DT_Pos) /*!< 0x0000C000 */
#define LTDC_GC1R_DT                  LTDC_GC1R_DT_Msk           /*!< dithering technique implemented */
#define LTDC_GC1R_GCT_Pos             (17U)
#define LTDC_GC1R_GCT_Msk             (0x7UL << LTDC_GC1R_GCT_Pos)/*!< 0x000E0000 */
#define LTDC_GC1R_GCT                 LTDC_GC1R_GCT_Msk          /*!< gamma correction technique implemented */
#define LTDC_GC1R_SHRA_Pos            (21U)
#define LTDC_GC1R_SHRA_Msk            (0x1UL << LTDC_GC1R_SHRA_Pos) /*!< 0x00200000 */
#define LTDC_GC1R_SHRA                LTDC_GC1R_SHRA_Msk         /*!< shadow registers ability */
#define LTDC_GC1R_BCP_Pos             (22U)
#define LTDC_GC1R_BCP_Msk             (0x1UL << LTDC_GC1R_BCP_Pos)/*!< 0x00400000 */
#define LTDC_GC1R_BCP                 LTDC_GC1R_BCP_Msk          /*!< background color programmability (unique color blended as background) */
#define LTDC_GC1R_BBA_Pos             (23U)
#define LTDC_GC1R_BBA_Msk             (0x1UL << LTDC_GC1R_BBA_Pos)/*!< 0x00800000 */
#define LTDC_GC1R_BBA                 LTDC_GC1R_BBA_Msk          /*!< background blending ability */
#define LTDC_GC1R_LNIP_Pos            (24U)
#define LTDC_GC1R_LNIP_Msk            (0x1UL << LTDC_GC1R_LNIP_Pos) /*!< 0x01000000 */
#define LTDC_GC1R_LNIP                LTDC_GC1R_LNIP_Msk         /*!< line-IRQ: line position programmability */
#define LTDC_GC1R_TP_Pos              (25U)
#define LTDC_GC1R_TP_Msk              (0x1UL << LTDC_GC1R_TP_Pos) /*!< 0x02000000 */
#define LTDC_GC1R_TP                  LTDC_GC1R_TP_Msk           /*!< timing programmability */
#define LTDC_GC1R_SPP_Pos             (27U)
#define LTDC_GC1R_SPP_Msk             (0x1UL << LTDC_GC1R_SPP_Pos)/*!< 0x08000000 */
#define LTDC_GC1R_SPP                 LTDC_GC1R_SPP_Msk          /*!< sync polarity programmability */
#define LTDC_GC1R_DWP_Pos             (28U)
#define LTDC_GC1R_DWP_Msk             (0x1UL << LTDC_GC1R_DWP_Pos)/*!< 0x10000000 */
#define LTDC_GC1R_DWP                 LTDC_GC1R_DWP_Msk          /*!< dither width programmability */
#define LTDC_GC1R_STRA_Pos            (29U)
#define LTDC_GC1R_STRA_Msk            (0x1UL << LTDC_GC1R_STRA_Pos) /*!< 0x20000000 */
#define LTDC_GC1R_STRA                LTDC_GC1R_STRA_Msk         /*!< status register ability */
#define LTDC_GC1R_CRMA_Pos            (30U)
#define LTDC_GC1R_CRMA_Msk            (0x1UL << LTDC_GC1R_CRMA_Pos) /*!< 0x40000000 */
#define LTDC_GC1R_CRMA                LTDC_GC1R_CRMA_Msk         /*!< configuration reading mode ability */
#define LTDC_GC1R_BMA_Pos             (31U)
#define LTDC_GC1R_BMA_Msk             (0x1UL << LTDC_GC1R_BMA_Pos)/*!< 0x80000000 */
#define LTDC_GC1R_BMA                 LTDC_GC1R_BMA_Msk          /*!< blind mode ability */

