STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231axx_cm33.h
#define IS_SPI_PARTIAL_INSTANCE(INSTANCE) (((INSTANCE) == SPI4_S) || ((INSTANCE) == SPI4_NS) || \
                                           ((INSTANCE) == SPI5_S) || ((INSTANCE) == SPI5_NS))

#define IS_SPI_LIMITED_INSTANCE(INSTANCE) (((INSTANCE) == SPI8_S) || ((INSTANCE) == SPI8_NS))

/************** SPI Instances : trigger input *********************************/
#define IS_SPI_TRIGGER_INPUT_INSTANCE(INSTANCE) (((INSTANCE) == SPI8_S) || ((INSTANCE) == SPI8_NS))

/****************** TIM Instances : All supported instances *******************/
#define IS_TIM_INSTANCE(INSTANCE)       (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                         ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                         ((INSTANCE) == TIM6_S)  || ((INSTANCE) == TIM6_NS)  || \
                                         ((INSTANCE) == TIM7_S)  || ((INSTANCE) == TIM7_NS)  || \
                                         ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS)  || \
                                         ((INSTANCE) == TIM10_S) || ((INSTANCE) == TIM10_NS) || \
                                         ((INSTANCE) == TIM11_S) || ((INSTANCE) == TIM11_NS) || \
                                         ((INSTANCE) == TIM12_S) || ((INSTANCE) == TIM12_NS) || \
                                         ((INSTANCE) == TIM13_S) || ((INSTANCE) == TIM13_NS) || \
                                         ((INSTANCE) == TIM14_S) || ((INSTANCE) == TIM14_NS) || \
                                         ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS) || \
                                         ((INSTANCE) == TIM16_S) || ((INSTANCE) == TIM16_NS) || \
                                         ((INSTANCE) == TIM17_S) || ((INSTANCE) == TIM17_NS))

/****************** TIM Instances : supporting 32 bits counter ****************/
#define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE) (((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                               ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                               ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                               ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS))

/****************** TIM Instances : supporting the break function *************/
#define IS_TIM_BREAK_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                            ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS)  || \
                                            ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS) || \
                                            ((INSTANCE) == TIM16_S) || ((INSTANCE) == TIM16_NS) || \
                                            ((INSTANCE) == TIM17_S) || ((INSTANCE) == TIM17_NS))

/************** TIM Instances : supporting Break source selection *************/
#define IS_TIM_BREAKSOURCE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                               ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS)  || \
                                               ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS) || \
                                               ((INSTANCE) == TIM16_S) || ((INSTANCE) == TIM16_NS) || \
                                               ((INSTANCE) == TIM17_S) || ((INSTANCE) == TIM17_NS))

/****************** TIM Instances : supporting 2 break inputs *****************/
#define IS_TIM_BKIN2_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS) || \
                                            ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

/************* TIM Instances : at least 1 capture/compare channel *************/
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                         ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                         ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS)  || \
                                         ((INSTANCE) == TIM10_S) || ((INSTANCE) == TIM10_NS) || \
                                         ((INSTANCE) == TIM11_S) || ((INSTANCE) == TIM11_NS) || \
                                         ((INSTANCE) == TIM12_S) || ((INSTANCE) == TIM12_NS) || \
                                         ((INSTANCE) == TIM13_S) || ((INSTANCE) == TIM13_NS) || \
                                         ((INSTANCE) == TIM14_S) || ((INSTANCE) == TIM14_NS) || \
                                         ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS) || \
                                         ((INSTANCE) == TIM16_S) || ((INSTANCE) == TIM16_NS) || \
                                         ((INSTANCE) == TIM17_S) || ((INSTANCE) == TIM17_NS))

/************ TIM Instances : at least 2 capture/compare channels *************/
#define IS_TIM_CC2_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                         ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                         ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS)  || \
                                         ((INSTANCE) == TIM12_S) || ((INSTANCE) == TIM12_NS) || \
                                         ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS))

/************ TIM Instances : at least 3 capture/compare channels *************/
#define IS_TIM_CC3_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                         ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                         ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

/************ TIM Instances : at least 4 capture/compare channels *************/
#define IS_TIM_CC4_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM4_S)  || ((INSTANCE) == TIM4_NS)  || \
                                         ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                         ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

/****************** TIM Instances : at least 5 capture/compare channels *******/
#define IS_TIM_CC5_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

/****************** TIM Instances : at least 6 capture/compare channels *******/
#define IS_TIM_CC6_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS))

